:PROPERTIES:
:ID: e53146d5-0b0c-4760-bbcc-400aa9c445ca
:END:
#+title: Add Feature Flag
#+description: Add Feature Flag
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:variability:
#+created: 2026-05-21
#+updated: 2026-05-21

Add a new feature flag.

#+name: add-feature-flag
#+begin_src ores-shell :exports none
variability add-flag test.feature.flag false "Test feature flag for recipes" system.new_record "Test"
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<add-feature-flag>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Feature flag added successfully!
ores-shell> Bye!
#+end_example
